---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.IDuctFittingAndAccessoryPressureDropServer.Calculate(Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData)
source: html/caf53d82-7454-bdb2-6ca0-cee7d9651d40.htm
---
# Autodesk.Revit.DB.Mechanical.IDuctFittingAndAccessoryPressureDropServer.Calculate Method

Calculate the duct fitting and duct accessory coefficient.

## Syntax (C#)
```csharp
bool Calculate(
	DuctFittingAndAccessoryPressureDropData data
)
```

## Parameters
- **data** (`Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData`) - The input and output data of the calculation.

## Returns
True if calculation succeeds.
 False if calculation fails.